{"Keep your spine straight, avoid bending forward or backward during the curl.": "voice/sentence_1.mp3", "Avoid swinging your left shoulder during the curl.": "voice/sentence_2.mp3", "Avoid swinging your right shoulder during the curl.": "voice/sentence_3.mp3", "Ensure proper shoulder engagement on the right side.": "voice/sentence_4.mp3", "Ensure proper shoulder engagement on the left side.": "voice/sentence_5.mp3", "Avoid pushing your right knee too far over your toes.": "voice/sentence_6.mp3", "Avoid pushing your left knee too far over your toes.": "voice/sentence_7.mp3", "Keep your upper body straight during the lunge.": "voice/sentence_8.mp3", "Ensure your right elbow is fully extended at the bottom of the pull-up.": "voice/sentence_9.mp3", "Ensure your left elbow is fully extended at the bottom of the pull-up.": "voice/sentence_10.mp3", "Ensure your right shoulder is fully engaged at the top of the pull-up.": "voice/sentence_11.mp3", "Ensure your left shoulder is fully engaged at the top of the pull-up.": "voice/sentence_12.mp3", "Keep your back straight during the push-up.": "voice/sentence_13.mp3", "Keep your back straight during the squat.": "voice/sentence_14.mp3", "Ensure your left hip bends to about 90 degrees during the squat.": "voice/sentence_15.mp3", "Ensure your right hip bends to about 90 degrees during the squat.": "voice/sentence_16.mp3", "Keep your back straight and avoid arching during the press.": "voice/Keep_your_back_straight_and_avoid_arching_during_t.mp3", "Fully extend your right elbow at the top of the press.": "voice/Fully_extend_your_right_elbow_at_the_top_of_the_pr.mp3", "Right elbow not detected.": "voice/Right_elbow_not_detected.mp3", "Curl your right arm up to about 30 degrees.": "voice/Curl_your_right_arm_up_to_about_30_degrees.mp3", "Fully extend your right arm at the bottom of the curl.": "voice/Fully_extend_your_right_arm_at_the_bottom_of_the_c.mp3", "Left elbow not detected.": "voice/Left_elbow_not_detected.mp3", "Left shoulder not detected.": "voice/Left_shoulder_not_detected.mp3", "Curl your left arm up to about 30 degrees.": "voice/Curl_your_left_arm_up_to_about_30_degrees.mp3", "Fully extend your left arm at the bottom of the curl.": "voice/Fully_extend_your_left_arm_at_the_bottom_of_the_cu.mp3", "Spine angle not detected.": "voice/Spine_angle_not_detected.mp3"}